aula25/app/models/father.rb

    def occupation_description
        if self.occupation.blank?
---
SELECT "occupations".* FROM "occupations" WHERE "occupations"."id" = 2 LIMIT 1