aula25/app/views/fathers/_father.html.erb

    <ul>
      <% @father.children.each do |child| %>
---
SELECT "children".* FROM "children" WHERE "children"."father_id" = 1