aula25/app/controllers/children_controller.rb

  def new
    @child = Child.new
    @fathers = Father.all
---
SELECT "fathers".* FROM "fathers"