aula25/app/controllers/fathers_controller.rb

  def index
    @fathers = Father.all
    @father = Father.first
---
SELECT "fathers".* FROM "fathers" ORDER BY "fathers"."id" ASC LIMIT 1

  def create
    @father = Father.new(father_params)

    respond_to do |format|
      if @father.save
---
INSERT INTO "fathers" ("name", "created_at", "updated_at", "cpf", "email", "occupation_id") VALUES ('', '2025-01-22 01:04:20.239017', '2025-01-22 01:04:20.239017', '294738625', 'oiiiii@gmail.com', 3) RETURNING "id"

  def update
    respond_to do |format|
      if @father.update(father_params)
---
UPDATE "fathers" SET "updated_at" = '2025-01-22 00:52:10.497395', "cpf" = '', "email" = '', "occupation_id" = 1 WHERE "fathers"."id" = 2

    def set_father
      @father = Father.find(params.expect(:id))
---
SELECT "fathers".* FROM "fathers" WHERE "fathers"."id" = 1 LIMIT 1

    def set_occupation
      @occupations = Occupation.all
---
SELECT "occupations".* FROM "occupations"