aula25/app/controllers/occupations_controller.rb

  def index
    @occupations = Occupation.all
---
SELECT "occupations".* FROM "occupations"

  def create
    @occupation = Occupation.new(occupation_params)

    respond_to do |format|
      if @occupation.save
---
INSERT INTO "occupations" ("description", "created_at", "updated_at") VALUES ('pedreiro', '2025-01-22 00:18:07.137689', '2025-01-22 00:18:07.137689') RETURNING "id"

  def update
    respond_to do |format|
      if @occupation.update(occupation_params)
---
UPDATE "occupations" SET "description" = 'médico', "updated_at" = '2025-01-22 00:18:41.941035' WHERE "occupations"."id" = 3

    def set_occupation
      @occupation = Occupation.find(params.expect(:id))
---
SELECT "occupations".* FROM "occupations" WHERE "occupations"."id" = 1 LIMIT 1